# 2 HW Python
# 1) Создать 2 переменных типа String с разными значениями
a = 'Privet'
a1 = "Medved"
list_1 = [a, a1]

# 2) Создать 4 переменных типа Integer с разными значениями
b1 = 221
b2 = -12
b3 = 12
b4 = -744


# 3) Создать 3 переменных типа Float с разными значениями
c1 = 7.55
c2 = -12.9
c3 = 7.555

# 4) Реализовать 15 варианта сравнения int переменных с операторами >, <, >=, <=, !=. Pезультаты весвести в консоль.
print("Реализовать 15 вариантов сравнения int ( b1 = 221, b2 = -12, b3 = 12, b4 = -744 )переменных с операторами >, <, >=, <=, !=. ")
print("b1 == b2", b1 == b2)
print("b1 == b3", b1 == b3)
print("b4 == b2", b4 == b2)
print("b1 != b2", b1 != b2)
print("b4 != b3", b4 != b2)
print("b3 != b2", b3 != b2)
print("b1 <= b2", b1 <= b2)
print("b1 <= b3", b1 <= b3)
print("b3 <= b2", b3 <= b2)
print("b4 >= b2", b4 >= b2)
print("b1 >= b3", b1 >= b3)
print("b3 >= b2", b3 >= b2)
print("b1 < b2", b1 < b2)
print("b1 < b3", b1 < b3)
print("b3 < b2", b3 < b2)
print("b4 > b2", b4 > b2)
print("b1 > b3", b1 > b3)
print("b3 > b2", b3 > b2)
print("b1 < b2", b1 < b2)
print("b4 < b3", b4 < b3)
print("b3 < b2", b3 < b2)

#5) Реализовать 9 варианта сравнения Float переменных с операторами >, <, >=, <=, !=. Pезультаты весвести в консоль.
print("Реализовать 9 вариантов сравнения Float ( c1 = 7.55, c2 = -12.9, c3 = 7.555 )переменных с операторами >, <, >=, <=, !=. ")
print("c1 != c2", c1 != c2)
print("c1 != c3", c1 != c2)
print("c3 != c2", c3 != c2)
print("c1 >= c2", c1 >= c2)
print("c1 >= c3", c1 >= c2)
print("c3 >= c2", c3 >= c2)
print("c1 < c2", c1 < c2)
print("c1 < c3", c1 < c2)
print("c3 < c2", c3 < c2)

#6) Реализовать 10 вариантов сравнения int переменных с операторами >, <, >=, <=, != и условными выражениями (end, or, not). Pезультаты весвести в консоль.
print("Реализовать 10 вариантов сравнения int (b1 = 221, b2 = -12, b3 = 12, b4 = -744 ) переменных с операторами >, <, >=, <=, != и условными выражениями (end, or, not).")
print("b1 == b2 or b3 == b4", b1 == b2 or b3 == b4)
print("b3 < b2 and b1 > b4", b3 < b2 and b1 > b4)
print("b1 == b4 or b2 >= b3", b1 == b4 or b2 >= b3)
print("b1 >= b2 and b3 <= b4", b1 >= b2 and b3 <= b4)
print("not (b1 == b2 or b3 == b4)", not (b1 == b2 or b3 == b4))
print("not (b1 == b2) and b3 <= b4", not (b1 == b2) and b3 <= b4)
print("b1 == b2 or b3 == b4 or b2 > b4 and b1 <= b3", b1 == b2 or b3 == b4 or b2 > b4 and b1 <= b3)
print("not (b1 == b2) and not (b3 == b4)", not (b1 == b2) and not (b3 == b4))
print("b1 != b2 and b3 != b4 and b1 >= b2", b1 != b2 and b3 != b4 and b1 >= b2)
print("b4 <= b2 or not (b3 != b4)", b4 <= b2 or not (b3 != b4))


